src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСокращенное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКОНХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНалоговой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнутренняяОрганизация</name>
    <comment>Организация-дубль контрагента</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИностранныйКонтрагент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеятельностьПрекращена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактныеЛица</name>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/УправленческийУчетСервер/Module.bsl
&НаСервере
Функция ПолучитьДанныеУправленческогоУчетаПоКатегории(КатегорияОперации, Заявка = Неопределено)
	
	МассивДанных = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(КатегорияОперации) Тогда
		Возврат МассивДанных;
	КонецЕсли;
	
	Для Каждого СтрокаПараметров Из КатегорияОперации.Параметры Цикл
		
		Если СтрокаПараметров.Имя = "КоррСчет"
			ИЛИ СтрокаПараметров.Внутренний Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураДанных = Новый Структура;
		
		Для Каждого Реквизит Из Метаданные.Справочники.КатегорииОпераций.ТабличныеЧасти.Параметры.Реквизиты Цикл
			
			СтруктураДанных.Вставить(Реквизит.Имя, СтрокаПараметров[Реквизит.Имя]);
			
		КонецЦикла;
		
		МассивДанных.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат МассивДанных;
	
КонецФункции

&НаСервере
Функция ЗаполнитьДанныеУправленческогоУчетаТипамиПВХ(МассивДанных)
	
	Для Каждого ЭлементДанных Из МассивДанных Цикл
		
		Если ЗначениеЗаполнено(СокрЛП(ЭлементДанных.Тип)) Тогда
			
			ВидПараметра = ПланыВидовХарактеристик.РеквизитыУправленческогоУчета.НайтиПоРеквизиту("ТипСтрокой", ЭлементДанных.Тип);
			
			Если ВидПараметра <> ПланыВидовХарактеристик.РеквизитыУправленческогоУчета.ПустаяСсылка() Тогда
				ЭлементДанных.Вставить("ВидПараметра", ВидПараметра);
			КонецЕсли;
			
		ИначеЕсли ЭлементДанных.Имя	= "ТипКредКарты" Тогда
			
			ЭлементДанных.Вставить("ВидПараметра", ПланыВидовХарактеристик.РеквизитыУправленческогоУчета.ТипСубконтоТипКарты);
			ЭлементДанных.Вставить("Значение", Справочники.ЗначенияСубконтоУправленческогоУчета.НайтиПоКоду("Visa"));
			
		ИначеЕсли ЭлементДанных.Имя	= "Счет_ОтвЛ" Тогда
			
			ЭлементДанных.Вставить("ВидПараметра", ПланыВидовХарактеристик.РеквизитыУправленческогоУчета.ТипСправочникБанковскиеСчета);
			//ЭлементДанных.Вставить("Значение", Справочники.ЗначенияСубконтоУправленческогоУчета.НайтиПоКоду("Visa"));
			
		ИначеЕсли ЭлементДанных.Имя	= "Контрагент" Тогда			
			ЭлементДанных.Вставить("ВидПараметра", ПланыВидовХарактеристик.РеквизитыУправленческогоУчета.ТипСправочникКонтрагенты);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивДанных;
	
КонецФункции

&НаСервере
Функция ПодготовитьДанныеУправленческогоУчета(КатегорияОперации) Экспорт
	
	Возврат ЗаполнитьДанныеУправленческогоУчетаТипамиПВХ(ПолучитьДанныеУправленческогоУчетаПоКатегории(КатегорияОперации));
	
КонецФункции

&НаСервере
Функция ДанныеТаблицыПоВнешнимДанным(КатегорияОперации, Данные) Экспорт
	
	ИменаКолонок = "Имя, Значение, ТипРеквизита, ЗапретРедактирования, Необязательный, ВидПараметра, Формула";
	МассивДанных = Новый Массив;
	
	// Заполняем из Категории
	Для Каждого СтрокаПараметры Из УправленческийУчетСервер.ПодготовитьДанныеУправленческогоУчета(КатегорияОперации) Цикл
		
		СтруктураТаблицы = Новый Структура(ИменаКолонок);
		ЗаполнитьЗначенияСвойств(СтруктураТаблицы, СтрокаПараметры);
		МассивДанных.Добавить(СтруктураТаблицы);
		
	КонецЦикла;
	
	Для Каждого СтруктураДанных Из МассивДанных Цикл
		
		Если СтруктураДанных.ВидПараметра = ПланыВидовХарактеристик.РеквизитыУправленческогоУчета.ТипСправочникЦФУ Тогда
			СтруктураДанных.Значение = Справочники.ЦФУ.НайтиПоКоду(СокрЛП(Данные.codeCFU));
			
		ИначеЕсли СтруктураДанных.ВидПараметра = ПланыВидовХарактеристик.РеквизитыУправленческогоУчета.ТипСправочникБрэнды Тогда
			СтруктураДанных.Значение = Справочники.Брэнды.НайтиПоКоду(СокрЛП(Данные.codeBrand));
			
		КонецЕсли;
		
		Для т = 0 по 8 Цикл
			
			Параметр = Данные["Параметр" + т];
			Если Параметр = СтруктураДанных.Имя Тогда
				
				ФорматПараметра = Данные["ФорматПараметра" + т];
				ЗначениеПараметра = Данные["s_sub" + (т + 1)];
				СтруктураДанных = СтруктураДанных;
				
				Если СтруктураДанных.ВидПараметра = ПланыВидовХарактеристик.РеквизитыУправленческогоУчета.ТипСправочникЦФУ
					ИЛИ СтруктураДанных.ВидПараметра = ПланыВидовХарактеристик.РеквизитыУправленческогоУчета.ТипСправочникБрэнды Тогда
					
					Продолжить;
					
				ИначеЕсли СтруктураДанных.ВидПараметра = ПланыВидовХарактеристик.РеквизитыУправленческогоУчета.ТипСправочникКонтрагенты Тогда
					СтруктураДанных.Значение = Справочники.Контрагенты.НайтиПоКоду(ЗначениеПараметра);
					
				ИначеЕсли СтруктураДанных.ВидПараметра.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЗначенияСубконтоУправленческогоУчета") Тогда
					СтруктураДанных.Значение = Справочники.ЗначенияСубконтоУправленческогоУчета.НайтиПоКоду(ЗначениеПараметра,,, СтруктураДанных.ВидПараметра);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	
КонецФункции

&НаСервере
Процедура ОбновитьТаблицуУправленческогоУчета(Объект, СтрокиОбработки) Экспорт
	
	Для Каждого СтрокаТаблицыУправленческогоУчета Из СтрокиОбработки Цикл
		
		СтрокаТаблицыВыписки = Объект.ДанныеВыписки.НайтиСтроки(Новый Структура("GUIDСтрокиВыписки", СтрокаТаблицыУправленческогоУчета.GUIDСтрокиВыписки))[0];
		
		Если СтрокаТаблицыУправленческогоУчета.Имя = "ВалютнаяСумма" Тогда
			СтрокаТаблицыУправленческогоУчета.Значение = СтрокаТаблицыВыписки.ВалютнаяСумма;
			
		ИначеЕсли СтрокаТаблицыУправленческогоУчета.Имя = "Сумма" Тогда
			СтрокаТаблицыУправленческогоУчета.Значение = Max(СтрокаТаблицыВыписки.СуммаПриход - СтрокаТаблицыВыписки.СуммаРасход, -(СтрокаТаблицыВыписки.СуммаПриход - СтрокаТаблицыВыписки.СуммаРасход));
			
		ИначеЕсли СтрокаТаблицыУправленческогоУчета.Имя = "НДС" Тогда
			СтрокаТаблицыУправленческогоУчета.Значение = СтрокаТаблицыВыписки.СуммаНДС;
			
		ИначеЕсли СтрокаТаблицыУправленческогоУчета.Имя = "Контрагент" Тогда
			СтрокаТаблицыУправленческогоУчета.Значение = СтрокаТаблицыВыписки.Контрагент;
			
		ИначеЕсли СтрокаТаблицыУправленческогоУчета.Имя = "Валюта" Тогда
			
			Если Объект.Валюта = Справочники.Валюты.ПустаяСсылка() Тогда
				СтрокаТаблицыУправленческогоУчета.Значение = ПараметрыСеанса.ВалютаРегламентированногоУчета;
			Иначе
				СтрокаТаблицыУправленческогоУчета.Значение = Объект.Валюта;
			КонецЕсли;
			
		КонецЕсли;
		
		// Попробуем применить формулу
		Формула = ВРЕГ(СтрокаТаблицыУправленческогоУчета.Формула);
		
		Если СтрокаТаблицыУправленческогоУчета.Имя = "ТипКредКарты" Тогда
			Формула = "";
		КонецЕсли;
		
		Формула = СтрЗаменить(Формула, "ТАБЛИЦА.КОНТРАГЕНТ", "ТАБЛИЦА.КОНТРАГЕНТ");
		Формула = СтрЗаменить(Формула, "ТАБЛИЦА.СЧЕТКОНТРАГЕНТА", "ТАБЛИЦА.СЧЕТКОНТРАГЕНТА");
		
		Если Формула = "СЧЕТ" Тогда
			Формула = СтрЗаменить(Формула, "СЧЕТ", "ОБЪЕКТ.СЧЕТОРГАНИЗАЦИИ");
		КонецЕсли;
		
		
		//Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		Формула = СтрЗаменить(Формула, "ТАБЛИЦА.ПРИХОД", "СТРОКАТАБЛИЦЫВЫПИСКИ.СУММАПРИХОД");
		Формула = СтрЗаменить(Формула, "ТАБЛИЦА.РАСХОД", "СТРОКАТАБЛИЦЫВЫПИСКИ.СУММАРАСХОД");
		Формула = СтрЗаменить(Формула, "-ОБЪЕКТ.СУММА", "СТРОКАТАБЛИЦЫВЫПИСКИ.ВАЛЮТНАЯСУММА");
		//ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета")
		//	ИЛИ ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.Заявка") Тогда
		//	Формула = СтрЗаменить(Формула, "ТАБЛИЦА.ПРИХОД", "0");
		//	Формула = СтрЗаменить(Формула, "ТАБЛИЦА.РАСХОД", "ОБЪЕКТ.ВАЛЮТНАЯСУММА");
		//КонецЕсли;
			
		Если СокрЛП(Формула) <> "" Тогда
			
			Таблица = СтрокаТаблицыВыписки;
			Значение = Неопределено;
			
			Попытка
				Выполнить("Значение = " + Формула);
				СтрокаТаблицыУправленческогоУчета.Значение = Значение;
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеУправленческогоУчета(Форма) Экспорт
	
	Объект = Форма.Объект;
	Объект.УправленческийУчет.Очистить();
	
	Для Каждого СтруктураДанных Из УправленческийУчетСервер.ПодготовитьДанныеУправленческогоУчета(Объект.КатегорияОперации) Цикл
		ЗаполнитьЗначенияСвойств(Объект.УправленческийУчет.Добавить(), СтруктураДанных);
	КонецЦикла;
	УправленческийУчетСервер.ОбновитьТаблицуУправленческогоУчета(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеУправленческогоУчетаДокумента(ДокументОбъект) Экспорт
	
	ДокументОбъект.УправленческийУчет.Очистить();
	
	Для Каждого СтруктураДанных Из УправленческийУчетСервер.ПодготовитьДанныеУправленческогоУчета(ДокументОбъект.КатегорияОперации) Цикл
		ЗаполнитьЗначенияСвойств(ДокументОбъект.УправленческийУчет.Добавить(), СтруктураДанных);
	КонецЦикла;
	УправленческийУчетСервер.ОбновитьТаблицуУправленческогоУчета(ДокументОбъект);
	
КонецПроцедуры
